In [1]:
import pandas as pd

In [2]:
# when data is arrange in columns.

In [3]:
names=['Shahid',"Hussain",'Zeerak']
hobbies=['coding','pc games','pc games']
height=['175cm','172cm','173cm']

In [7]:
df=pd.DataFrame({'Name':names, 'Hobbies':hobbies,'Height':height})

In [8]:
df

      Name   Hobbies Height
0   Shahid    coding  175cm
1  Hussain  pc games  172cm
2   Zeerak  pc games  173cm

In [9]:
df.set_index('Hobbies')

             Name Height
Hobbies
coding     Shahid  175cm
pc games  Hussain  172cm
pc games   Zeerak  173cm

In [10]:
#when the data is arrange in row

In [11]:
row1=['Shahid',"Hussain",'Zeerak']
row2=['coding','pc games','pc games']
row3=['175cm','172cm','173cm']

In [17]:
df1=pd.DataFrame(data=[row1,row2,row3],columns=['Names','Hobbies','Height'])

In [18]:
df1

    Names   Hobbies    Height
0  Shahid   Hussain    Zeerak
1  coding  pc games  pc games
2   175cm     172cm     173cm

In [19]:
df1.set_index("Hobbies")

           Names    Height
Hobbies
Hussain   Shahid    Zeerak
pc games  coding  pc games
172cm      175cm     173cm

In [20]:
# how to create data frame from series... using TO_Frame method

In [27]:
df3=pd.Series(data=hobbies ,name="Hobbies").to_frame()

In [28]:
df3

    Hobbies
0    coding
1  pc games
2  pc games